       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.

       PROCEDURE DIVISION.
       para-main.
           DISPLAY "Hello world!"
           STOP RUN
           .
